{"template":"../src/containers/Post","sharedHashesByProp":{},"data":{"title":"What is Aftermath? (1/2)","slug":"what-is-aftermath-1","date":"2017-4-16","mins":15,"summary":"What is Aftermath? Aftermath is a Source SDK mod created and started by me for learning the Source engine and for fun. The mod was inspired from the infamous \"zombies\" mode in Black Ops after having a lot of fun playing it with friends, the original idea was to fully replicate the mode as much as possible with sounds and models from the game.","contents":"<p>What is Aftermath? Aftermath is a Source SDK mod created and started by me for learning the Source engine and for fun. The mod was inspired from the infamous &quot;zombies&quot; mode in Black Ops after having a lot of fun playing it with friends, the original idea was to fully replicate the mode as much as possible with sounds and models from the game but I was getting increasingly paranoid of being sued so this changed half way through development.</p>\n<p>The mod started off with Zombie Survival which was a terrible name to begin with and was purely used for testing but ended up sticking. Zombie Survival was going to be single player only because I had no idea how to do multiplayer so the first iteration was the singleplayer &quot;alpha&quot; version with a couple of maps which is what this blog post will be focussing on.</p>\n<p>We&#39;ll start with the maps:</p>\n<h3 id=\"zs_example-map\">zs_example map</h3>\n<p>zs_example was one of the only maps made by me, it&#39;s a square room with some stairs going up to a balcony that goes around the entire room it had some random rocks as unlockable doors and some weapons/grenades that you could buy. It looks terrible and those point lights could&#39;ve gone a little lower but it was going in the mod no matter what!</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody><tr>\n<td><img src=\"/images/posts/zs_example.jpg\" alt=\"zs_example map\"></td>\n<td><img src=\"/images/posts/zs_example_1.jpg\" alt=\"zs_example map 2\"></td>\n</tr>\n</tbody></table>\n<h3 id=\"zs_factory-map\">zs_factory map</h3>\n<p>zs_factory was made by Sam or GR3AVE5Y and was actually built from zs_example but obviously looked a lot better, it had another floor which had a hole that broke when you stood on it that took you to the first floor kinda completed the loop that you would expect. There was a small room as you can see in the image below to the right that contained another zombie spawn and frag grenades.</p>\n<p>I believe this map was the only map made by Sam but a second one was being made but was never finished. The map was left in the map for some time as it aged well and in the future it did recieve some new additions such as the automatic turret and some new weapons.</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody><tr>\n<td><img src=\"/images/posts/zs_factory.jpg\" alt=\"zs_factory map\"></td>\n<td><img src=\"/images/posts/zs_factory_1.jpg\" alt=\"zs_factory map 2\"></td>\n</tr>\n</tbody></table>\n<h3 id=\"zs_haywire-map\">zs_haywire map</h3>\n<p>zs_haywire was made by Poho and was a large area with stairs going up to a room, it was a pretty small map and didn&#39;t really work but I kept it in the mod as I always wanted to expand it. The map had some good ideas and looked good with the endless tunnel and fire effects so it stayed for some time until Poho made his second map.</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody><tr>\n<td><img src=\"/images/posts/zs_haywire.jpg\" alt=\"zs_haywire map\"></td>\n<td><img src=\"/images/posts/zs_haywire_1.jpg\" alt=\"zs_haywire map 2\"></td>\n</tr>\n</tbody></table>\n<p>Next time we&#39;ll go through the features that where implemented into <a href=\"/projects/aftermath\">Aftermath</a> and explain how a lot of them where done and why, some of the features where done from tutorials for example the ironsights but most are custom and I thought it would be best to explain them rather than hand out the entire source for the mod.</p>\n"},"path":"blog/what-is-aftermath-1"}
