{"template":"../src/pages/projects.js","sharedHashesByProp":{},"data":{"projects":[{"title":"New Website","slug":"new-website","summary":"I realised that my site is a bit over complicated with what I wanted it to be, I'm working on a new version of the site that uses React, GraphQL, Apollo and Node that should be straight to the point in terms of projects and blog posts.","image":"website.png","homepage":true,"contents":"<p>I realised that my site is a bit over complicated with what I wanted it to be, I&#39;m working on a new version of the site that uses React, GraphQL, Apollo and Node that should be straight to the point in terms of projects and blog posts.</p>\n"},{"title":"Resurgence","slug":"resurgence","summary":"Resurgence deploys you in shoes of a young resistance member, who have escaped from Nova Prospekt thanks to one free man, and is willing to find his old friends in order to reunite and fight together for the future of the human race.","image":"res.png","homepage":true,"contents":"<p>Resurgence deploys you in shoes of a young resistance member, who have escaped from Nova Prospekt thanks to one free man, and is willing to find his old friends in order to reunite and fight together for the future of the human race. Arrive at City 37 to help regain the throne from the falling empire of Combine and bring back the world we all knew at one point.</p>\n"},{"title":"Readarr","slug":"readarr","summary":"Readarr is a PVR for Usenet and BitTorrent users. It can monitor multiple RSS feeds for new ebooks and will grab, sort and rename them.","image":"readarr.png","homepage":true,"contents":"<p>Readarr is a PVR for Usenet and BitTorrent users. It can monitor multiple RSS feeds for new ebooks and will grab, sort and rename them.</p>\n"},{"title":"Aftermath","slug":"aftermath","summary":"Aftermath also known as Aftermath:Source and initally Zombie Survival is a HL2 mod created using C++ on the Source engine.","image":"aftermath.png","homepage":true,"contents":"<p>Aftermath also known as Aftermath:Source and initally Zombie Survival is a HL2 mod created using C++ on the Source engine. It began when I decided to create a game similar to Call of Duty&#39;s Zombies mode as I enjoyed playing it and wanted to create something similar, this began with trying to replicate various gameplay features but ended with some custom features to try and seperate itself from the franchise.</p>\n"},{"title":"Fall of Saigon","slug":"fall-of-saigon","summary":"Fall of Saigon is a Vietnam War modification for the Half-Life 2 source engine. The modification will be based in the realism of the Vietnam War, trying to portray things, events, and places as they actually were.","image":"fos.jpg","contents":"<p>Fall of Saigon is a Vietnam War modification for the Half-Life 2: source engine. The modification will be based in the realism of the Vietnam War, trying to portray things, events, and places as they actually were. The gameplay will also reflect as much of the realistic feeling as the development team is able to portray. The game will recreate the feeling of the jungle, or place the player in Saigon, or anywhere in between.</p>\n"},{"title":"IP security camera","slug":"ip-security-camera","summary":"I was previously using zoneminder for the security camera but not only was it old but it was a resource hog and took forever to start up. It also streamed using MJPEG which is an older way of streaming and stored videos as a series of images so I found a replacement called Shinobi that was also free and open source.","image":"camera.png","contents":"<p>I was previously using zoneminder for the security camera but not only was it old but it was a resource hog and took forever to start up. It also streamed using MJPEG which is an older way of streaming and stored videos as a series of images so I found a replacement called Shinobi that was also free and open source. </p>\n"},{"title":"Smart Custom LED strip","slug":"smart-led-strip","summary":"LED strip controlled by a ESP8266 board for Wifi connectivity, currently used behind my TV and integrated with Plex for colour changing.","image":"led-strip.png","contents":"<p>LED strip controlled by a ESP8266 board for Wifi connectivity, currently used behind my TV and integrated with Plex for colour changing.</p>\n"},{"title":"Test","slug":"test","summary":"Test is a multiplayer game built with WebGL (Pixi 2d) and Node.js inspired by a game I made using SFML and Box2d. It is a space game where you fly a ship between \"sectors\" that are individual solar systems.","image":"test.png","contents":"<p>&quot;Test&quot; is a multiplayer game built with WebGL (Pixi 2d) and Node.js inspired by a game I made using SFML and Box2d. It is a space game where you fly a ship between &quot;sectors&quot; that are individual solar systems. One feature of the game is the ability to create your own ship and upgrade it as you play.</p>\n"}]},"path":"projects"}
