{"template":"../src/containers/Post","sharedHashesByProp":{},"data":{"title":"Grafana Beginnings","slug":"grafana-beginnings","date":"2020-05-02T00:00:00.000Z","mins":5,"summary":"After recently loosing a drive in my RAID array I decided it's probably a good idea to monitor my server.","contents":"<p>After recently loosing a drive in my RAID array I decided it&#39;s probably a good idea to monitor my server, my old server was a little HP ProLiant MicroServer Gen8 that was dual core and had 4gb (until I upgraded it to 8) and used to have an ELK stack running for log parsing and monitoring but it used way too much ram so had to be shutdown.</p>\n<p>My new server is a lot more powerful and is an enterprise Dell R610 so there&#39;s room for a monitoring container or 5!</p>\n<h2 id=\"hello-influxdb\">Hello InfluxDB</h2>\n<p>InfluxDB is a database built for time series so it&#39;s perfect for time based data.</p>\n<p>It also has a powerful query language with useful functions, Grafana provides a nice UI for building out the queries which I&#39;ve only had to not use once to build a custom query.</p>\n<p>Elasticsearch is very powerful and can also be used with Grafana but I decided against it due to resource issues still and it&#39;s not worth it for my medium sized server.</p>\n<h2 id=\"telegraf\">Telegraf</h2>\n<p>The ELK stack used Logstash to provide parsed data from logs to Elasticsearch which is what the L in ELK is.</p>\n<p>Telegraf is similar to the their Metricbeat &quot;plugin&quot;, it defines a bunch of inputs, outputs and processors in between. It has support for a lot of inputs by default, I haven&#39;t looked in to it yet but it looks simple enough to make a plugin using Go.</p>\n<p>By default it sends host information over to InfluxDB such as cpu, ram, disk usage, kernel information etc. Personally I enabled the &quot;docker&quot;, &quot;filecount&quot;, &quot;ipmi_sensor&quot;, &quot;snmp&quot;, &quot;snmp_trap&quot;, &quot;net&quot;, &quot;netstat&quot; and &quot;vsphere&quot; inputs.</p>\n<p>More to come on those inputs later.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>I&#39;m still playing around with Grafana and understanding everything it has to offer, I want to get more stats in to it from apps that are not supported in Telegraf but it&#39;s working well so far.</p>\n"},"path":"blog/grafana-beginnings"}
