{"template":"../src/containers/Post","sharedHashesByProp":{},"data":{"title":"Enabling brush ladders","slug":"enabling-brush-ladders","date":"2018-7-10","mins":7,"summary":"A request while working on Resurgence was to add brush ladders which are a simpler implementation that don't use dismount points but instead fling you off the ladder at the top or bottom.","contents":"<p>A request while working on Resurgence was to add brush ladders which are a simpler implementation that don&#39;t use dismount points but instead fling you off the ladder at the top or bottom, they are way easier to create in Hammer and easier to use as a player.</p>\n<p>I found out how to do it when searching about the brush ladder and found this <a href=\"%22https://developer.valvesoftware.com/wiki/Co-Operative_Base_(Mod)%22\">page</a> that listed it had managed to enable brush ladders, I checked out the source code for the enabling the brush ladder and it basically just disables the HL2 gamemovement that uses the gamemovement.cpp file as it&#39;s base and has some extra ladder code for handling dismounts. You can check out the file <a href=\"%22https://github.com/whoozzem/SecobMod/blob/master/mp/src/game/shared/hl2/hl_gamemovement.cpp%22\">here</a></p>\n<p>After that any brushes with func_ladder or textures with the climbable flag can be used as ladders, I would recommend changing the climb speed in shareddefs.h (103) and altering the velocity that the player gets pushed away from the ladder at which by default is <a href=\"%22https://github.com/ValveSoftware/source-sdk-2013/blob/master/sp/src/game/shared/gamemovement.cpp#L2939%22\">270</a>.</p>\n<p>It was way easier than I expected as whenever I went to tackle the issue I would look in func_ladder or gamemovement.cpp and didn&#39;t think about checking out the HL2 specific movement rules..</p>\n<p>Code is available on my Github as always, just replace your file with the file in <a href=\"%22https://gist.github.com/tingtom/5a3a92e7146eea8b74873a78edcb8dca%22\">this gist</a></p>\n"},"path":"blog/enabling-brush-ladders"}
